In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
df1 = DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                "data1": range(7)})

In [4]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [5]:
df2 = DataFrame({"key": ["a", "b", "d"],
                "data2": range(3)})

In [6]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [7]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [8]:
pd.merge(df1, df2, on = "key")

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [9]:
df3 = DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
                "data1": range(7)})

In [10]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [11]:
df4 = DataFrame({"rkey": ["a", "b", "d"],
                "data2": range(3)})

In [12]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [13]:
pd.merge(df3, df4, left_on = "lkey", right_on = "rkey")

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [14]:
pd.merge(df1, df2, how = "outer")

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [15]:
df1 = DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                "data1": range(6)})

In [16]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [17]:
df2 = DataFrame({"key": ["a", "b", "a", "b", "d"],
                "data2": range(5)})

In [18]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [19]:
pd.merge(df1, df2, on="key", how="left")

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

In [20]:
pd.merge(df1, df2, how="inner")

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [21]:
left = DataFrame({"key1": ["foo", "foo", "bar"],
                 "key2": ["one", "two", "one"],
                 "lval": [1, 2, 3]})

In [22]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [23]:
right = DataFrame({"key1": ["foo", "foo", "bar", "bar"],
                  "key2": ["one", "one", "one", "two"],
                  "rval": [4, 5, 6, 7]})

In [24]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [25]:
pd.merge(left, right, on=["key1", "key2"], how="outer")

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [26]:
pd.merge(left, right, on="key1")

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [27]:
pd.merge(left, right, on="key1", suffixes=("_left", "_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [28]:
left1 = DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                  "value": range(6)})

In [29]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [30]:
right1 = DataFrame({"group_val": [3.5, 7]}, index = ["a", "b"])

In [31]:
right1

   group_val
a        3.5
b        7.0

In [32]:
pd.merge(left1, right1, left_on="key", right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [33]:
pd.merge(left1, right1, left_on="key", right_index=True, how="outer")

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [34]:
lefth = DataFrame({"key1": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada"],
                  "key2": [2000, 2001, 2002, 2001, 2002],
                  "data": np.arange(5.)})

In [35]:
lefth

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [36]:
righth = DataFrame(np.arange(12).reshape((6, 2)),
                  index = [["Nevada", "Nevada", "Ohio", "Ohio", "Ohio", "Ohio"],
                          [2001, 2000, 2000, 2000, 2001, 2002]],
                          columns = ["event1", "event2"])

In [37]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [38]:
pd.merge(lefth, righth, left_on=["key1", "key2"], right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

In [39]:
pd.merge(lefth, righth, left_on=["key1", "key2"],
        right_index=True, how="outer")

   data    key1  key2  event1  event2
0   0.0    Ohio  2000     4.0     5.0
0   0.0    Ohio  2000     6.0     7.0
1   1.0    Ohio  2001     8.0     9.0
2   2.0    Ohio  2002    10.0    11.0
3   3.0  Nevada  2001     0.0     1.0
4   4.0  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000     2.0     3.0

In [40]:
left2 = DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=["a", "c", "e"],
                 columns = ["Ohio", "Nevada"])

In [41]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [42]:
right2 = DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                  index = ["b", "c", "d", "e"], columns = ["Missouri", "Alabama"])

In [43]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [44]:
pd.merge(left2, right2, how="outer", left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [45]:
left2.join(right2, how="outer")

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [46]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [47]:
right1

   group_val
a        3.5
b        7.0

In [48]:
left1.join(right1, on="key")

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [49]:
another = DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                   index = ["a", "c", "e", "f"], columns = ["New York", "Oregon"])

In [50]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [51]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [52]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [53]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [54]:
left2.join([right2, another], how="outer")

c:\python27\lib\site-packages\pandas\core\frame.py:6369: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  verify_integrity=True)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [55]:
arr = np.arange(12).reshape((3, 4))

In [56]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [57]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [58]:
s1 = Series([0, 1], index=["a", "b"])

In [59]:
s1

a    0
b    1
dtype: int64

In [60]:
s2 = Series([2, 3, 4], index=["c", "d", "e"])

In [61]:
s2

c    2
d    3
e    4
dtype: int64

In [62]:
s3 = Series([5, 6], index=["f", "g"])

In [63]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [64]:
pd.concat([s1, s2, s3], axis=1)

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [65]:
s4 = pd.concat([s1 * 5, s3])

In [66]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [67]:
pd.concat([s1, s4], axis=1)

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [68]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [69]:
pd.concat([s1, s4], axis=1, join_axes=[["a", "c", "b", "e"]])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

In [70]:
result = pd.concat([s1, s1, s3], keys=["one", "two", "three"])

In [71]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [72]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [73]:
pd.concat([s1, s2, s3], axis=1, keys=["one", "two", "three"])

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [74]:
df1 = DataFrame(np.arange(6).reshape(3, 2), index=["a", "b", "c"],
               columns=["one", "two"])

In [75]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [76]:
df2 = DataFrame(5 + np.arange(4).reshape(2, 2), index=["a", "c"],
               columns=["three", "four"])

In [77]:
df2

   three  four
a      5     6
c      7     8

In [78]:
pd.concat([df1, df2], axis=1, keys=["level1", "level2"])

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [79]:
pd.concat({"level1": df1, "level2": df2}, axis=1)

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [80]:
pd.concat([df1, df2], axis=1, keys=["level1", "level2"],
         names=["upper", "lower"])

c:\python27\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [81]:
df1 = DataFrame(np.random.randn(3, 4), columns = ["a", "b", "c", "d"])

In [82]:
df1

          a         b         c         d
0  1.545898 -2.164035  0.446819  0.493345
1 -0.766337 -1.797117  0.287869  0.018034
2 -0.256848 -0.471778 -0.107537 -0.186540

In [83]:
df2 = DataFrame(np.random.randn(2, 3), columns = ["b", "d", "a"])

In [84]:
df2

          b         d         a
0  1.726641  0.076441  0.446597
1 -0.319160  0.345242 -1.774857

In [85]:
pd.concat([df1, df2], ignore_index = True)

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  1.545898 -2.164035  0.446819  0.493345
1 -0.766337 -1.797117  0.287869  0.018034
2 -0.256848 -0.471778 -0.107537 -0.186540
3  0.446597  1.726641       NaN  0.076441
4 -1.774857 -0.319160       NaN  0.345242

In [86]:
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
          index = ["f", "e", "d", "c", "b", "a"])

In [87]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [88]:
b = Series(np.arange(len(a), dtype = np.float64),
          index = ["f", "e", "d", "c", "b", "a"])

In [89]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [90]:
b[-1] = np.nan

In [91]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [92]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [93]:
b[:-2]

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

In [94]:
a[2:]

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [95]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [96]:
df1 = DataFrame({"a": [1., np.nan, 5., np.nan],
                "b": [np.nan, 2., np.nan, 6.],
                "c": range(2, 18, 4)})

In [97]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [98]:
df2 = DataFrame({"a": [5., 4., np.nan, 3., 7.],
                "b": [np.nan, 3., 4., 6., 8.]})

In [99]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [100]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [101]:
data = DataFrame(np.arange(6).reshape((2, 3)),
                index = pd.Index(["Ohio", "Colorado"], name = "state"),
                columns = pd.Index(["one", "two", "three"], name = "number"))

In [102]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [103]:
result = data.stack()

In [104]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [105]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [106]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [107]:
result.unstack("state")

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [108]:
s1 = Series([0, 1, 2, 3], index=["a", "b", "c", "d"])

In [109]:
s1

a    0
b    1
c    2
d    3
dtype: int64

In [110]:
s2 = Series([4, 5, 6], index = ["c", "d", "e"])

In [111]:
s2

c    4
d    5
e    6
dtype: int64

In [112]:
data2 = pd.concat([s1, s2], keys = ["one", "two"])

In [113]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [114]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [115]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [116]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [117]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [118]:
df = DataFrame({"left": result, "right": result + 5},
              columns = pd.Index(["left", "right"], name = "side"))

In [119]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [120]:
df.unstack("state")

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [121]:
df.unstack("state").stack("side")

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [122]:
data = DataFrame({"k1": ["one"] * 3 + ["two"] * 4,
                 "k2": [1, 1, 2, 3, 3, 4, 4]})

In [123]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [124]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [125]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [126]:
data["v1"] = range(7)

In [127]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [128]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [129]:
data.drop_duplicates(["k1", "k2"])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [132]:
data = DataFrame({"food": ["bacon", "pulled pork", "bacon", "Pastrami",
                          "corned beef", "Bacon", "pastrami", "honey ham",
                          "nova lox"],
                 "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [133]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [134]:
meat_to_animal = {"bacon": "pig",
                 "pulled pork": "pig",
                 "pastrami": "cow",
                 "corned beef": "cow",
                 "honey ham": "pig",
                 "nova lox": "salmon"}

In [135]:
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [139]:
data["animal"] = data["food"].map(str.lower).map(meat_to_animal)

In [140]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [141]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [142]:
data = Series([1., -999., 2., -999., -1000., 3.])

In [143]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [144]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [145]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [146]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [147]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [148]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                index = ["Ohio", "Colorado", "New York"],
                columns = ["one", "two", "three", "four"])

In [149]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [150]:
data.index.map(str.upper)

Index([u'OHIO', u'COLORADO', u'NEW YORK'], dtype='object')

In [151]:
data.index = data.index.map(str.upper)

In [152]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [153]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [154]:
data.rename(index={"OHIO": "INDIANA"},
           columns = {"three": "peekaboo"})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [155]:
_ = data.rename(index={"OHIO": "INDIANA"}, inplace=True)

In [156]:
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [157]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [158]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [159]:
bins = [18, 25, 35, 60, 100]

In [160]:
cats = pd.cut(ages, bins)

In [161]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [164]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [165]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [166]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [167]:
bins

[18, 25, 35, 60, 100]

In [169]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [170]:
data = np.random.rand(20)

In [171]:
data

array([0.57778272, 0.25361483, 0.53804562, 0.28623049, 0.70895871,
       0.73623242, 0.24555085, 0.48518934, 0.43592023, 0.50148173,
       0.08276876, 0.09308738, 0.41156617, 0.44950113, 0.87358944,
       0.85080593, 0.53482054, 0.33896579, 0.76472569, 0.8434334 ])

In [172]:
pd.cut(data, 4, precision=2)

[(0.48, 0.68], (0.082, 0.28], (0.48, 0.68], (0.28, 0.48], (0.68, 0.87], ..., (0.68, 0.87], (0.48, 0.68], (0.28, 0.48], (0.68, 0.87], (0.68, 0.87]]
Length: 20
Categories (4, interval[float64]): [(0.082, 0.28] < (0.28, 0.48] < (0.48, 0.68] < (0.68, 0.87]]

In [173]:
data = np.random.randn(1000)

In [174]:
data

array([ 3.63262935e-01, -9.58015704e-01,  2.50969643e-01, -1.75669716e+00,
        6.76683094e-01,  1.20153519e-01,  5.73338734e-01, -5.57963896e-01,
        5.96326587e-01,  5.02328546e-01, -1.75728458e+00, -8.71787344e-02,
       -1.69071344e+00,  4.49014596e-01,  3.31853668e-03,  6.10385249e-01,
       -1.17689297e+00,  9.66830667e-01, -4.16044948e-01,  1.78350660e+00,
       -4.79419182e-01,  5.99478710e-01, -3.40361164e-01,  2.11026784e-01,
       -3.87056185e-01, -1.15823636e-01, -1.32492926e+00,  1.24661725e-01,
        5.53543735e-01, -1.04636454e+00, -2.01489697e-01, -7.65792211e-01,
        3.55405534e-01, -4.29085209e-01,  6.23213746e-01,  1.03338651e+00,
       -1.97969709e-01, -1.90987067e+00,  8.20476589e-02, -1.11206234e+00,
        3.88206746e-01,  1.08530348e+00,  1.15679205e-01, -1.90847680e-01,
       -2.41145583e-01, -6.75006716e-01,  1.56806171e+00,  1.15190739e+00,
        1.41463570e-01,  1.12616987e+00, -1.09070205e+00,  1.47484309e-01,
        7.53818087e-01,  1.41021829e+00,  1.58769583e+00,  2.85728337e-01,
       -3.91513798e-01, -1.27750365e+00, -1.15000118e+00,  1.55898963e-01,
        5.70594938e-01, -1.06257270e+00, -1.55625714e+00, -1.73112114e-01,
       -1.01839059e+00,  4.15075250e-01,  8.31625479e-01,  5.30347731e-01,
       -9.78600479e-01, -3.64375021e-01, -6.97004659e-01,  3.89497450e-01,
        9.13428394e-01,  2.56955255e-02,  2.84685318e-01,  1.27416410e+00,
        8.60878280e-01,  3.66149233e-01, -1.23835575e-01, -8.84416033e-01,
       -1.18420010e+00,  1.05505883e+00,  2.35740896e+00,  8.51198483e-01,
       -1.15433629e+00, -1.02240288e+00, -1.61677952e+00, -3.83168430e-01,
        1.08408843e+00, -2.81543620e-01,  7.02616782e-01,  1.04097078e+00,
       -2.97708825e-01, -1.46939411e+00,  2.06615672e+00, -2.31972101e-01,
       -4.26482643e-01, -2.85784924e-01,  1.54697013e+00,  5.66232311e-01,
        4.10192464e-01, -7.76340737e-01, -1.23532235e+00,  3.49264919e-01,
        7.39745010e-01,  2.53174866e-01,  1.46469247e-01, -5.62745966e-01,
        1.42081153e+00, -4.57489280e-02, -1.26447031e+00, -2.03964820e+00,
        2.53354053e+00, -1.52151428e+00, -1.27436052e-01, -1.13244319e+00,
        7.75671948e-01,  4.48482313e-01, -6.46104719e-01,  6.57639665e-01,
        1.11746087e+00, -1.29651986e+00,  2.22939576e-01,  2.46006127e+00,
       -1.61467148e+00,  1.25646990e+00, -2.60324076e-01, -4.48510709e-01,
        1.85173987e+00,  9.57697350e-01, -1.81916748e-01, -8.00438766e-01,
       -1.95941316e-01, -1.81108190e+00,  2.90284175e-01,  3.33859572e-01,
       -1.09361317e+00, -4.52796215e-01,  2.38872798e+00,  1.77084112e+00,
        2.50079867e-01, -9.64948654e-01, -1.72654666e+00,  4.53916420e-01,
        1.74820898e-01, -5.10833889e-02,  4.44857571e-01,  3.14945697e-01,
        5.43016764e-01, -6.12232570e-01, -1.02623224e+00, -8.40562166e-02,
        2.29547625e-01,  1.20508315e+00, -9.78156400e-01,  9.96550803e-01,
        1.10886683e+00, -5.22572569e-01, -1.40268253e+00,  2.83207551e-01,
       -2.28945605e-01, -7.29260079e-01, -8.00263768e-01,  4.07406133e-01,
        5.55041479e-01,  1.56557816e+00, -2.11272599e-03, -2.20052943e-02,
       -3.92745474e-02, -4.12286386e-02, -2.84007922e-01,  2.00512924e-01,
       -5.57832250e-01,  2.14856527e+00,  7.93135354e-01,  1.89352912e+00,
        3.41276632e-01,  8.27573433e-01, -3.11650499e-01,  2.14176266e-03,
        2.93363015e-01, -1.04269712e-02,  1.44290767e-01, -7.65860231e-01,
        1.10369099e+00, -4.56205682e-02, -8.89170520e-01,  6.49627374e-01,
        7.99322660e-02,  3.71986926e-01, -3.80027789e-01,  4.62695600e-01,
       -1.12926190e+00,  5.41037831e-01,  5.83951875e-01,  1.62837495e+00,
        4.56739419e-01,  5.97220937e-01,  9.15324658e-01,  1.28732966e+00,
        8.05799467e-01,  7.35645782e-01,  4.13820890e-01, -3.79324243e-01,
       -7.66474630e-01,  9.18928626e-01,  7.00418210e-01, -3.11678556e-02,
        7.04866323e-01, -7.12662863e-02,  3.53499682e-01, -7.79190966e-01,
        1.07300857e+00, -2.34557296e+00,  1.20764332e-01,  2.80434832e+00,
        1.20264181e+00, -7.37510907e-01,  2.18901359e+00, -1.13711448e+00,
        4.76267761e-01, -8.08239816e-01, -1.70597310e+00,  2.21777033e-01,
        7.78214001e-01,  1.05319809e+00, -1.10083260e+00,  5.52091659e-01,
        7.44031709e-01,  7.15283019e-01,  7.83692111e-02, -2.50657383e-01,
        8.95443048e-01, -5.17169584e-01, -2.32018685e+00, -6.05597189e-01,
        4.50305480e-01, -3.23295781e-01, -1.36180543e-01, -1.92641258e-01,
       -2.67662958e-01,  1.38694646e+00, -1.55872845e-01, -6.46653462e-01,
       -7.45421618e-01, -1.29976565e+00,  2.93246509e-01, -6.23845912e-01,
        4.52359261e-01,  9.27708629e-01,  5.75876730e-01, -1.24173488e+00,
        2.35841736e+00, -6.43692981e-02,  2.40499005e-01, -1.15597466e-01,
        1.06518698e-01, -8.89428676e-02, -3.36877120e-01, -3.43411383e-02,
        1.76030217e-01, -1.19825907e+00, -3.65900872e-01, -2.00860894e+00,
        2.21109514e-01, -1.07054133e+00,  7.73045663e-01,  1.58369326e-01,
        1.01570881e+00,  2.80657217e-01, -1.29784437e+00, -1.97971521e+00,
        2.33745826e-01, -7.79794724e-01,  2.64484310e-01,  8.39623739e-03,
        8.96050173e-01,  3.02060666e-01, -7.60131671e-02,  5.17603851e-01,
       -2.01303828e+00,  7.92671705e-01,  3.63675923e-01,  1.86342898e+00,
       -6.75329561e-01, -2.08719691e+00, -7.45729591e-02, -1.36678510e+00,
       -1.13889136e+00,  1.16475130e+00, -1.01578060e+00, -1.65675897e-01,
        8.41070951e-02,  4.25720901e-04,  3.75920750e-01,  1.06145801e-01,
        5.52404666e-01,  7.65539041e-02,  9.68600627e-01, -1.16681247e+00,
       -6.60017813e-01,  5.04837662e-02,  1.20610367e+00,  1.18286395e+00,
       -2.02049290e+00,  1.55719527e-01,  9.93465303e-01,  1.23780577e+00,
        3.48670952e-01,  3.76824390e-01,  6.10437331e-01,  1.04162743e+00,
        1.23370627e-02,  1.73403480e-01, -5.06497577e-01, -1.70463030e+00,
        8.08223793e-01,  6.57280926e-01, -2.81248414e-01, -1.17768907e-01,
        1.67745213e+00,  1.13992947e+00,  4.76533032e-01, -1.50202134e-01,
       -3.27135671e-01, -1.05320085e-01, -1.12849108e-01,  1.39894825e+00,
       -8.64621391e-01,  4.49193778e-01,  3.36724132e-02, -9.88595253e-01,
        2.41896344e-01,  1.25187623e-02, -9.14439960e-01,  8.85930030e-01,
        2.15818614e-01,  5.85743616e-01,  8.08945612e-02, -3.47432973e-01,
        4.11180248e-01, -1.43196007e+00, -8.01350956e-01, -5.42319612e-01,
        1.74576928e-01, -1.74393304e-01,  7.85667129e-01, -2.32338276e-02,
       -3.46928174e-01,  9.13844338e-01, -1.89367471e-01, -1.14611169e+00,
        4.71033258e-02, -9.21174777e-02, -3.83421235e-01, -9.74484127e-02,
       -5.28243396e-03,  1.36388313e+00,  7.72997520e-01, -8.72261488e-01,
       -8.43201414e-01,  2.55195734e-01,  1.95106645e+00,  5.45661549e-01,
        1.04086751e+00, -2.70116500e-01, -1.92399518e+00, -1.36822197e-01,
        1.71096327e-01,  1.27844736e+00, -3.57144543e-01,  4.25877588e-01,
        4.25344833e-02,  7.72074888e-01,  1.26056324e+00, -7.40525621e-01,
       -1.89245543e+00,  3.30838476e-01, -3.03062317e+00, -4.13026049e-01,
       -6.07024016e-01, -9.27277000e-01, -1.14771407e+00,  1.19590560e+00,
       -3.75137064e-01, -3.55833233e-01,  1.65121097e+00,  3.64384126e-01,
       -3.23815839e-01, -1.40055597e-02,  2.11596431e+00, -5.96698228e-01,
        2.05915322e-01, -6.09800582e-02,  1.18666292e-01, -1.19137641e-01,
       -8.33238228e-01, -1.03983233e+00, -1.80840762e-01, -2.21253676e-01,
        1.39685021e-01, -1.58553299e+00, -3.20237097e-01, -1.32472527e+00,
        7.72773108e-02, -9.79779608e-02,  1.11247398e+00,  1.22952324e+00,
       -4.49788499e-01, -1.96977583e-01,  1.28195911e+00,  1.03174324e+00,
        6.00946358e-01, -2.55340855e-01, -4.37827264e-01, -3.32976007e-01,
       -6.06647499e-02,  2.93738807e-03,  4.05032862e-01, -6.50204740e-01,
        1.55579958e-01, -3.97107711e-01, -1.63494229e+00, -2.08357199e+00,
       -1.03474177e+00,  8.43299691e-01, -2.97550394e-01,  1.77945451e+00,
       -7.01311813e-01,  7.19130044e-01, -2.02312862e+00,  3.17883260e-01,
       -1.93098042e-02,  6.14008085e-01,  1.03567930e+00,  8.67121112e-01,
       -2.45812477e-01, -8.56574496e-01,  3.31640193e-03, -8.12610320e-01,
       -4.08387077e-01,  4.03396104e-01,  3.84766462e-01, -1.00939029e+00,
        7.64626585e-01,  6.29189419e-01, -5.28581677e-01, -1.81224227e-01,
        4.77986922e-01, -7.75339505e-02,  1.11288440e-02,  8.91027814e-01,
        3.07293286e-01, -5.68667038e-01, -7.82115131e-01, -1.18744301e-01,
       -1.99405728e+00, -1.96262745e+00, -5.94667053e-01,  1.18382740e+00,
        4.38814819e-01, -9.16880785e-01,  1.03646524e+00, -1.57066033e+00,
        2.71618514e+00, -9.32251249e-01, -5.30917993e-01,  7.09802398e-01,
        2.13350673e+00, -6.87745479e-01,  1.00151142e-01,  1.41479996e-01,
       -9.32025046e-01, -7.64530562e-01,  7.52386596e-01,  1.38534982e-01,
        1.18525663e+00,  8.76586170e-01,  3.55090495e-01, -3.82183264e-01,
       -8.03783103e-01,  1.06060998e+00,  9.35068628e-01, -3.22289951e-01,
        4.96907426e-01,  3.81717296e+00,  1.66039497e-01, -4.90226445e-02,
        1.49817173e+00, -1.19438251e+00, -8.00381274e-01,  3.93825366e-01,
        4.82674379e-01,  5.02731198e-01,  3.58651149e-02,  8.15805650e-01,
        7.23525305e-01,  4.52788075e-01,  2.27944059e+00,  1.96182667e-01,
        6.33262512e-01, -5.47398804e-01,  1.21169648e+00,  5.26368417e-02,
        1.03730181e+00, -1.07556069e+00,  4.60693141e-01, -7.02652597e-02,
       -2.82636407e-01,  9.72265713e-01,  7.30137362e-01,  5.20744324e-01,
       -6.19984247e-01,  2.51747398e+00, -8.31157476e-02, -8.21514090e-01,
       -4.63080274e-01, -2.94205931e-01,  1.17357251e+00,  4.30827417e-01,
       -1.38273456e+00, -1.42175133e+00,  1.11969795e+00,  1.74343418e+00,
       -1.50923524e+00,  1.27834547e+00, -2.39291521e-01,  1.54022241e+00,
       -2.37627181e-01, -5.78343135e-02,  1.48509075e+00, -2.37708470e-01,
       -7.34882835e-01, -4.94346681e-01, -2.19840790e+00, -1.14742857e+00,
       -1.89968596e-01, -6.68150192e-01,  4.29698856e-01,  5.95739521e-01,
       -1.74735548e-01,  1.01653536e+00,  6.44667774e-02,  1.65081516e+00,
        1.40169312e+00,  1.21660752e+00, -8.35643750e-01, -2.16012280e-01,
       -9.63193695e-01, -6.80824365e-01, -3.09571404e-01,  7.65514910e-01,
       -9.39602547e-01,  1.06388587e+00, -4.45105797e-01,  8.98043461e-01,
        1.51814965e+00,  2.88048072e-01, -2.89698164e-02, -3.96570988e-02,
       -5.82110295e-01,  5.01462108e-01,  1.33806859e+00,  1.77030290e+00,
        1.51982142e-01,  1.67144157e+00, -8.34860044e-01,  7.54228845e-01,
        3.30756822e-02, -3.64666575e-03,  3.03023376e-01,  9.93864318e-01,
        1.05423458e+00,  4.50724702e-01, -1.30082097e+00,  6.13163831e-01,
       -4.07175808e-01,  1.23999074e+00,  1.57046793e-01, -1.38088208e+00,
       -2.83928771e+00, -2.00563470e-01, -1.29308691e+00,  1.28423490e+00,
       -1.72404062e+00,  3.79280630e-01,  1.09476895e+00,  5.61637559e-01,
        1.41905692e+00,  1.58006133e+00,  4.63970448e-02, -1.04341515e+00,
       -1.11656837e+00, -1.50165607e+00,  5.65384386e-01, -1.09066541e+00,
       -5.61334835e-01, -5.25356134e-01, -8.75921977e-01, -1.70000055e+00,
        6.36586701e-01, -3.53379156e-01, -2.77364303e-01,  1.31281725e+00,
        2.35472748e+00, -9.62246612e-01, -1.21775408e-01, -2.81137738e-01,
        2.12536557e+00,  2.34490300e+00,  2.90174669e-01, -3.21442469e-01,
        1.60637055e+00, -6.10362671e-01,  3.35017221e-01, -8.74672250e-01,
       -8.19412658e-01, -2.16420420e-01,  1.44953396e+00, -3.59121046e-02,
       -2.69179951e-01, -1.37929452e+00,  2.20882306e+00,  1.16432038e+00,
        6.26794939e-01,  2.90399273e-01,  4.10467368e-01,  6.00894886e-01,
       -3.26866082e-01, -1.31680666e+00,  1.22729655e+00, -1.06227969e+00,
       -6.99363756e-02,  1.01003964e+00, -1.44658370e+00,  2.19545104e+00,
       -8.93425542e-02,  2.82148278e-01, -8.21603817e-01,  7.51594220e-01,
       -1.97854211e-01, -7.79199429e-01,  9.23246164e-01, -7.51907534e-01,
       -5.09977228e-01,  8.01303805e-01,  5.41191387e-01, -6.50603941e-02,
        5.54637139e-01,  1.56708477e+00,  1.39437006e+00, -1.49436526e+00,
        2.74957766e-01,  3.54263187e-01,  3.52964395e-01,  6.01862528e-01,
       -1.19725793e+00, -8.83678397e-02,  1.47389468e+00, -3.38765369e-01,
       -3.42702852e-01, -1.09349272e+00,  6.45785373e-01,  1.39503111e+00,
       -3.65265701e-01,  7.81427319e-01, -8.92580836e-01, -3.71122797e-01,
       -1.85909059e+00, -4.56285589e-01,  7.46944248e-02, -4.45502224e-01,
       -4.07928199e-01,  1.47353545e+00,  3.30743852e-01,  1.44510619e+00,
        1.15598949e+00,  1.32247189e+00,  1.23212916e+00,  1.17131771e-01,
        1.08654446e-01,  3.07809564e-01,  1.32316477e+00, -8.61002734e-01,
       -6.00514876e-01,  9.59093623e-01, -4.28209714e-01, -2.28004962e+00,
        1.21428868e-01, -5.13080358e-01,  1.74106367e+00, -1.41546570e-02,
        6.55637897e-01,  6.79586926e-01, -1.83030527e+00, -7.73516428e-01,
        8.43120585e-01,  6.07285462e-01,  1.42368704e+00, -1.55922717e-01,
       -6.41824149e-02,  1.00964214e+00, -1.57926298e+00, -3.87276944e-01,
       -1.67464470e+00,  6.49906664e-01, -2.49072270e-01, -1.43024532e+00,
        7.73010871e-02,  2.58430345e-01,  8.51016499e-01,  7.35803347e-01,
       -2.04699492e-02, -2.22412847e-01,  4.03632131e-01,  3.45999001e-02,
       -1.59490637e+00,  1.41679314e+00, -3.68197592e-02, -9.55826249e-02,
       -2.11470720e-01, -5.24908222e-01, -1.50341624e+00,  3.60689123e-01,
       -1.19203032e+00,  1.17185300e+00, -7.93884683e-01,  8.49083674e-02,
       -2.79156653e-01,  1.79714073e+00, -1.54193168e+00,  3.94053121e-01,
       -4.19206390e-01, -1.69006793e+00, -1.06263247e-01, -9.53799317e-01,
        1.92152126e+00, -2.48307007e-01, -4.09722966e-01, -4.78438725e-01,
        2.06613793e+00,  1.31602851e-02, -3.01901612e-01,  8.87831602e-02,
       -9.48940946e-01, -6.81165398e-01,  1.20017970e-01, -5.35389386e-01,
       -6.24030155e-01,  2.98818732e-01,  4.64847061e-01,  2.51419604e-01,
        5.33429436e-01,  9.02024322e-02, -7.79602283e-01, -2.52144644e-01,
        1.32638604e+00, -8.46322275e-01, -1.90584774e+00,  1.31917925e-01,
       -2.02504032e+00,  1.03849373e+00, -4.10602482e-01,  6.80098601e-01,
        1.70465536e+00, -1.69833339e+00,  5.73726162e-01, -1.17250342e+00,
        2.58770121e-01,  1.01091209e+00, -3.27020474e-01,  1.10706760e+00,
        8.42513672e-01,  3.64324696e-01, -2.85424243e-01, -1.05560932e+00,
        5.76944201e-01,  4.26220509e-01, -8.64701263e-01,  3.34877522e-02,
       -1.78170738e-01, -8.74986876e-01, -1.21425806e+00,  8.93024572e-01,
        1.33714046e+00,  3.01369499e-01, -1.76652833e-01, -7.65151899e-01,
        1.38731511e+00,  3.02084820e-01, -1.35475860e-01, -9.01034595e-01,
       -1.19400086e-01,  7.52652334e-01, -7.46753178e-01, -6.08652906e-01,
       -1.28554046e+00, -2.24725297e+00, -7.66688160e-01, -1.01408758e+00,
        2.93637518e-01, -8.33765823e-01, -3.31002487e-01, -9.32560318e-01,
        2.89503145e-01, -5.98722394e-01, -2.96358104e-01, -2.26006278e+00,
        5.31689973e-01, -8.16132834e-01,  1.17766091e+00,  1.48173809e-01,
       -1.78840727e+00, -1.68869457e+00,  1.09448925e+00,  7.50951532e-02,
       -2.07155529e-01, -8.00652516e-01, -3.32573731e-01,  7.14418554e-02,
        5.77105095e-01, -4.26642958e-01,  6.63971243e-01,  1.08285225e+00,
       -1.40089769e+00,  1.35212513e+00, -7.58016512e-01, -1.80747317e+00,
        7.73030357e-01, -7.67338472e-02,  9.44750511e-02,  2.82735408e-01,
        3.74126911e-01, -9.49471223e-01, -1.93617846e-01,  2.15062205e-02,
       -1.02321433e+00,  6.80939840e-01, -7.55305544e-01,  1.29248214e+00,
        9.02034239e-02, -2.71617029e-01, -1.63604806e-01,  1.09613424e+00,
        7.08356623e-01,  7.60866641e-02,  6.54075659e-01, -4.46686534e-01,
       -1.69788698e+00, -1.91414672e-01, -1.23599774e+00,  1.18538844e+00,
        4.30707712e-01, -9.94406912e-01,  1.14564461e-01, -2.17185971e-01,
       -8.30143404e-01, -3.61296843e-01, -3.57547662e-01,  7.66403740e-01,
        2.22750682e-01,  1.19631955e+00,  4.67170178e-02,  9.32503978e-01,
        1.18590948e+00,  1.65401154e-01,  3.15357575e-01, -1.30244600e+00,
        7.98299059e-01,  2.97038310e-01,  1.41289145e+00,  1.45567968e+00,
        4.01905229e-01, -1.18732594e+00,  1.19251926e+00, -7.54530005e-01,
       -6.02155803e-01,  1.60440099e+00, -1.13702070e+00,  5.56063720e-01,
       -2.76174018e-01, -6.49027535e-01,  7.20031595e-01, -5.79605526e-01,
        2.99513920e-01,  4.38868003e-01,  6.00453976e-01,  3.23011729e-01,
       -1.42958945e+00,  1.21497744e+00,  6.21454033e-01,  1.69862999e+00,
       -1.12175637e+00,  5.90469343e-01, -5.81012719e-01, -6.35367883e-01,
       -4.28725712e-01, -8.88388833e-01, -9.48909141e-01,  1.44945045e-01,
        5.52656828e-02, -8.06963463e-01,  1.32585792e+00,  4.91122239e-01,
       -1.31474741e-01, -1.09497913e-01,  2.17034191e+00,  4.91001982e-01,
       -7.05438774e-01, -1.10520284e+00,  5.52544567e-01,  3.62488392e-02,
       -4.57183249e-01,  3.12545865e-01, -8.55147392e-01,  7.77125303e-01,
       -5.96120762e-01,  5.11266433e-01,  1.20695045e-01, -7.04278471e-02,
       -3.87067508e-01, -9.89671652e-03,  2.00205795e+00,  2.86286122e-01,
        5.38196548e-03, -2.00065516e-01, -4.29234635e-01, -1.60257767e-01,
       -4.04405881e-01, -1.39842099e+00, -2.67453738e+00,  1.67465301e+00,
        1.88402570e-01,  6.77326541e-01,  2.03815755e+00, -6.70468794e-02,
       -6.06780829e-01,  3.58516968e-02,  1.13568563e+00,  3.46686148e-01,
        1.68866453e+00, -6.90137237e-01,  1.83654298e-01, -1.57556796e-01,
       -2.83344996e-02,  1.01736487e+00,  1.51427103e-01, -8.53052191e-03,
        8.96718901e-02,  1.37957975e-01, -3.96528765e-01,  2.01225612e+00,
        2.38489712e-01, -9.17807015e-01,  4.91850598e-02, -7.18627465e-01,
       -1.90635574e+00, -4.12016029e-01, -1.38431590e-01,  2.92713998e-02,
       -6.07600646e-01, -2.65615995e-01,  1.16279288e+00,  5.47049693e-01,
        3.34358484e-01, -1.89376041e-01, -3.66039010e+00, -4.04895479e-02,
        7.54877600e-01, -6.08677166e-01, -1.48976492e+00, -1.31249481e+00,
       -7.33464827e-01,  8.64983790e-01, -9.66178916e-01,  1.08058018e+00,
       -9.74381259e-01, -9.17776271e-01,  6.91526099e-01,  1.13212165e+00,
       -7.76123442e-01, -6.57783535e-01, -1.68229402e+00,  7.40592197e-01,
       -1.03005105e+00, -1.99481780e-01, -1.54948767e+00,  1.34809292e+00,
        1.53855911e-01, -8.22129980e-01,  1.25052795e-01,  2.54043075e-01,
        1.29441443e+00,  4.27776404e-01, -1.43941727e+00,  3.29427717e-01,
       -8.64223015e-01, -7.30661664e-01,  4.23464363e-01,  7.85532246e-01])

In [175]:
cats = pd.qcut(data, 4)   # Cut into quartiles

In [176]:
cats

[(0.0312, 0.63], (-3.661, -0.607], (0.0312, 0.63], (-3.661, -0.607], (0.63, 3.817], ..., (0.0312, 0.63], (-3.661, -0.607], (-3.661, -0.607], (0.0312, 0.63], (0.63, 3.817]]
Length: 1000
Categories (4, interval[float64]): [(-3.661, -0.607] < (-0.607, 0.0312] < (0.0312, 0.63] < (0.63, 3.817]]

In [177]:
pd.value_counts(cats)

(0.63, 3.817]       250
(0.0312, 0.63]      250
(-0.607, 0.0312]    250
(-3.661, -0.607]    250
dtype: int64

In [178]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0312, 1.218], (-1.167, 0.0312], (0.0312, 1.218], (-3.661, -1.167], (0.0312, 1.218], ..., (0.0312, 1.218], (-1.167, 0.0312], (-1.167, 0.0312], (0.0312, 1.218], (0.0312, 1.218]]
Length: 1000
Categories (4, interval[float64]): [(-3.661, -1.167] < (-1.167, 0.0312] < (0.0312, 1.218] < (1.218, 3.817]]

In [179]:
np.random.seed(12345)

In [181]:
data = DataFrame(np.random.randn(1000, 4))

In [182]:
data

            0         1         2         3
0   -0.204708  0.478943 -0.519439 -0.555730
1    1.965781  1.393406  0.092908  0.281746
2    0.769023  1.246435  1.007189 -1.296221
3    0.274992  0.228913  1.352917  0.886429
4   -2.001637 -0.371843  1.669025 -0.438570
5   -0.539741  0.476985  3.248944 -1.021228
6   -0.577087  0.124121  0.302614  0.523772
7    0.000940  1.343810 -0.713544 -0.831154
8   -2.370232 -1.860761 -0.860757  0.560145
9   -1.265934  0.119827 -1.063512  0.332883
10  -2.359419 -0.199543 -1.541996 -0.970736
11  -1.307030  0.286350  0.377984 -0.753887
12   0.331286  1.349742  0.069877  0.246674
13  -0.011862  1.004812  1.327195 -0.919262
14  -1.549106  0.022185  0.758363 -0.660524
15   0.862580 -0.010032  0.050009  0.670216
16   0.852965 -0.955869 -0.023493 -2.304234
17  -0.652469 -1.218302 -1.332610  1.074623
18   0.723642  0.690002  1.001543 -0.503087
19  -0.622274 -0.921169 -0.726213  0.222896
20   0.051316 -1.157719  0.816707  0.433610
21   1.010737  1.824875 -0.997518  0.850591
22  -0.131578  0.912414  0.188211  2.169461
23  -0.114928  2.003697  0.029610  0.795253
24   0.118110 -0.748532  0.584970  0.152677
25  -1.565657 -0.562540 -0.032664 -0.929006
26  -0.482573 -0.036264  1.095390  0.980928
27  -0.589488  1.581700 -0.528735  0.457002
28   0.929969 -1.569271 -1.022487 -0.402827
29   0.220487 -0.193401  0.669158 -1.648985
..        ...       ...       ...       ...
970  1.140886  0.113279  0.206782 -1.460094
971 -1.523554 -0.590572 -0.324064  0.132262
972  0.097878  1.244456 -0.048534 -1.091849
973 -0.738296  0.115881  0.016253 -1.243078
974 -1.969172 -1.141360  0.405558 -0.521155
975 -0.813280 -0.461413  1.159668 -0.307670
976  0.669147  0.397355  0.612537  1.381155
977 -0.042541  1.182125  0.153036  0.075798
978  0.615651 -1.992291  0.963044  0.102469
979  0.359400  0.355787 -0.799366  1.120895
980 -0.261844 -0.474138 -0.112021 -0.285176
981 -0.136429  1.285628  0.753586  0.053410
982 -0.355393  0.790731  1.274794  0.233619
983 -1.316005  1.396082  0.336700  0.604880
984  0.675317 -0.060329  1.801953 -0.335099
985 -0.754114  0.650691  0.365401  1.367213
986 -0.105654 -0.001860  0.316802 -0.512542
987 -0.052736 -0.457225  2.452835 -1.050942
988 -0.172078  0.853049 -0.356263 -0.387002
989  0.881601  1.067288  1.079688  1.642339
990 -0.103672 -0.882949 -0.197357  1.336648
991  0.926782 -0.527103  0.633763  0.153988
992 -0.527754  0.815104 -0.677870 -1.466596
993  0.957144  0.377342 -0.383241  1.101972
994  1.221058 -0.326481  0.750008  0.604072
995  1.089085  0.251232 -1.451985  1.653126
996 -0.478509 -0.010663 -1.060881 -1.502870
997 -1.946267  1.013592  0.037333  0.133304
998 -1.293122 -0.322542 -0.782960 -0.303340
999  0.089987  0.292291  1.177706  0.882755

[1000 rows x 4 columns]

In [183]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [184]:
col = data[3]

In [185]:
col

0     -0.555730
1      0.281746
2     -1.296221
3      0.886429
4     -0.438570
5     -1.021228
6      0.523772
7     -0.831154
8      0.560145
9      0.332883
10    -0.970736
11    -0.753887
12     0.246674
13    -0.919262
14    -0.660524
15     0.670216
16    -2.304234
17     1.074623
18    -0.503087
19     0.222896
20     0.433610
21     0.850591
22     2.169461
23     0.795253
24     0.152677
25    -0.929006
26     0.980928
27     0.457002
28    -0.402827
29    -1.648985
         ...
970   -1.460094
971    0.132262
972   -1.091849
973   -1.243078
974   -0.521155
975   -0.307670
976    1.381155
977    0.075798
978    0.102469
979    1.120895
980   -0.285176
981    0.053410
982    0.233619
983    0.604880
984   -0.335099
985    1.367213
986   -0.512542
987   -1.050942
988   -0.387002
989    1.642339
990    1.336648
991    0.153988
992   -1.466596
993    1.101972
994    0.604072
995    1.653126
996   -1.502870
997    0.133304
998   -0.303340
999    0.882755
Name: 3, Length: 1000, dtype: float64

In [190]:
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [192]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [194]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

In [195]:
df = DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [196]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [197]:
sampler = np.random.permutation(5)

In [198]:
sampler

array([1, 0, 2, 3, 4])

In [199]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [204]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [205]:
bag = np.array([5, 7, -1, 6, 4])

In [206]:
bag

array([ 5,  7, -1,  6,  4])

In [207]:
sampler = np.random.randint(0, len(bag), size=10)

In [208]:
sampler

array([3, 0, 1, 2, 2, 3, 2, 1, 2, 0])

In [209]:
draws = bag.take(sampler)

In [210]:
draws

array([ 6,  5,  7, -1, -1,  6, -1,  7, -1,  5])

In [211]:
df = DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
               "data1": range(6)})

In [212]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [213]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [214]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [215]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [218]:
df_with_dummy = df[["data1"]].join(dummies)

In [219]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [221]:
val = "a, b,   guido"

In [222]:
val.split(",")

['a', ' b', '   guido']

In [223]:
pieces = [x.strip() for x in val.split(",")]

In [224]:
pieces

['a', 'b', 'guido']

In [227]:
first, second, third = pieces

In [228]:
first + "::" + second + "::" + third

'a::b::guido'

In [229]:
"::".join(pieces)

'a::b::guido'

In [230]:
"guido" in val

True

In [231]:
val

'a, b,   guido'

In [232]:
val.index(",")

1

In [233]:
val.find(":")

-1

In [234]:
val.count(",")

2

In [235]:
val.replace(",", "::")

'a:: b::   guido'

In [236]:
val.replace(",", "")

'a b   guido'

In [237]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
       "Rob": "rob@gmail.com", "Wes": np.nan}

In [238]:
data

{'Dave': 'dave@google.com',
 'Rob': 'rob@gmail.com',
 'Steve': 'steve@gmail.com',
 'Wes': nan}

In [239]:
data = Series(data)

In [240]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [241]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [242]:
data.str.contains("gmail")

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object